app/controllers/api/v1/users_controller.rb

      def update
        current_user.update!(user_params)
---
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "new username"], ["updated_at", "2019-04-08 10:31:23.911621"], ["id", 25]]