app/controllers/records_controller.rb

INSERT INTO "records" ("distance", "time", "date", "user", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["distance", 1000], ["time", 50], ["date", "2019-04-05 00:00:00"], ["user", 1], ["created_at", "2019-04-09 08:33:35.347388"], ["updated_at", "2019-04-09 08:33:35.347388"]]
---
    def create
        @record = Record.new(record_params)
        if @record.save

SELECT  "records".* FROM "records" WHERE "records"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @record = Record.find(params[:id])

SELECT  "records".* FROM "records" WHERE "records"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "records" SET "distance" = $1, "time" = $2, "updated_at" = $3 WHERE "records"."id" = $4  [["distance", 4000], ["time", 200], ["updated_at", "2019-04-09 08:50:41.471759"], ["id", 2]]
---
    def update
        @record = Record.find(params[:id])
        if @record.update(record_params)

SELECT  "records".* FROM "records" WHERE "records"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "records" WHERE "records"."id" = $1  [["id", 2]]
---
    def destroy
        @record = Record.find(params[:id])
        @record.destroy

SELECT "records".* FROM "records" WHERE (date between ('2019-04-05 00:00:00') and ('2019-04-06 00:00:00'))
---
    def filtered_by_date
        from = params[:from]
        to = params[:to]

        @records = Record.where("date between (?) and (?)", from, to)